tekkanat_refined/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
|                                                                             |
|    HiSA: High Speed Aerodynamic solver                                      |
|    Copyright (C) 2014-2017 Johan Heyns - CSIR, South Africa                 |
|    Copyright (C) 2014-2017 Oliver Oxtoby - CSIR, South Africa               |
|                                                                             |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version         2.0;
    format          ascii;
    class           dictionary;
    location        "system";
    object          controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application       hisa;

startFrom         startTime;

startTime         0;

stopAt            endTime;

endTime           1500;

deltaT            1;

writeControl      timeStep;

writeInterval     100;

purgeWrite        1;

writeFormat       ascii;

writePrecision    8;

writeCompression  off;

timeFormat        general;

timePrecision     6;

graphFormat       raw;

runTimeModifiable yes;

functions
{
    #includeFunc "forces"
    #includeFunc "forcesNormAxial"
}


// ************************************************************************* //
