tekkanat_refined/0/k
/*--------------------------------*- C++ -*----------------------------------*\
|                                                                             |
|    HiSA: High Speed Aerodynamic solver                                      |
|    Copyright (C) 2014-2017 Johan Heyns - CSIR, South Africa                 |
|    Copyright (C) 2014-2017 Oliver Oxtoby - CSIR, South Africa               |
|                                                                             |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 2600;  // = 3/2*I*|U|^2 for I = 0.01 & U = 412

boundaryField
{
    "(BC2)"
    {
        type            kLowReWallFunction;
        value           uniform 1e-11;
    }

    "(BC1)"
    {
        type            turbulentIntensityKineticEnergyInlet;
        intensity       0.01; // 1% turbulence intensity
        value           $internalField;
    }


}


// ************************************************************************* //
