tekkanat_refined/system/forces
/*--------------------------------*- C++ -*----------------------------------*\
|                                                                             |
|    HiSA: High Speed Aerodynamic solver                                      |
|    Copyright (C) 2014-2017 Johan Heyns - CSIR, South Africa                 |
|    Copyright (C) 2014-2017 Oliver Oxtoby - CSIR, South Africa               |
|                                                                             |
\*---------------------------------------------------------------------------*/
forces
{
    type           forces;
    libs           ( "libforces.so" );
    patches        ( BC2 );
    rho            rho;
    log            off;
    writeControl   timeStep;
    writeInterval  10;
    CofR           (0 0 0);
}


// ************************************************************************* //
